# 地理坐标系
# 
# 	地理坐标系组件用于地图的绘制，支持在地理坐标系上绘制散点图，线集
# 	
# 	


from pyecharts import Geo

data = [
	("海门", 9),("鄂尔多斯", 12),("招远", 12),("舟山", 12),("齐齐哈尔", 14),("盐城", 15),
	("赤峰", 16),("青岛", 18),("乳山", 18),("金昌", 19),("泉州", 21),("莱西", 21),
	("日照", 21),("胶南", 22),("南通", 23),("拉萨", 24),("云浮", 24),("梅州", 25),
	("文登", 25),("上海", 25),("攀枝花", 25),("威海", 25),("承德", 25),("厦门", 26),
	("汕尾", 26),("潮州", 26),("丹东", 27),("太仓", 27),("曲靖", 27),("烟台", 28),
	("福州", 29),("瓦房店", 30),("即墨", 30),("抚顺", 31),("玉溪", 31),("张家口", 31),
	("阳泉", 31),("莱州", 32),("湖州", 32),("汕头", 32),("昆山", 33),("宁波", 33),
	("湛江", 33),("揭阳", 34),("荣成", 34),("连云港", 35),("葫芦岛", 35),("常熟", 36),
	("东莞", 36),("河源", 36),("淮安", 36),("泰州", 36),("南宁", 37),("营口", 37),
    ("惠州", 37),("江阴", 37),("蓬莱", 37),("韶关", 38),("嘉峪关", 38),("广州", 38),
    ("延安", 38),("太原", 39),("清远", 39),("中山", 39),("昆明", 39),("寿光", 40),
    ("盘锦", 40),("长治", 41),("深圳", 41),("珠海", 42),("宿迁", 43),("咸阳", 43),
    ("铜川", 44),("平度", 44),("佛山", 44),("海口", 44),("江门", 45),("章丘", 45),
    ("肇庆", 46),("大连", 47),("临汾", 47),("吴江", 47),("石嘴山", 49),("沈阳", 50),
    ("苏州", 50),("茂名", 50),("嘉兴", 51),("长春", 51),("胶州", 52),("银川", 52),
    ("张家港", 52),("三门峡", 53),("锦州", 54),("南昌", 54),("柳州", 54),("三亚", 54),
    ("自贡", 56),("吉林", 56),("阳江", 57),("泸州", 57),("西宁", 57),("宜宾", 58),
    ("呼和浩特", 58),("成都", 58),("大同", 58),("镇江", 59),("桂林", 59),("张家界", 59),
    ("宜兴", 59),("北海", 60),("西安", 61),("金坛", 62),("东营", 62),("牡丹江", 63),
    ("遵义", 63),("绍兴", 63),("扬州", 64),("常州", 64),("潍坊", 65),("重庆", 66),
    ("台州", 67),("南京", 67),("滨州", 70),("贵阳", 71),("无锡", 71),("本溪", 71),
    ("克拉玛依", 72),("渭南", 72),("马鞍山", 72),("宝鸡", 72),("焦作", 75),("句容", 75),
    ("北京", 79),("徐州", 79),("衡水", 80),("包头", 80),("绵阳", 80),("乌鲁木齐", 84),
    ("枣庄", 84),("杭州", 84),("淄博", 85),("鞍山", 86),("溧阳", 86),("库尔勒", 86),
    ("安阳", 90),("开封", 90),("济南", 92),("德阳", 93),("温州", 95),("九江", 96),
    ("邯郸", 98),("临安", 99),("兰州", 99),("沧州", 100),("临沂", 103),("南充", 104),
    ("天津", 105),("富阳", 106),("泰安", 112),("诸暨", 112),("郑州", 113),("哈尔滨", 114),
    ("聊城", 116),("芜湖", 117),("唐山", 119),("平顶山", 119),("邢台", 119),("德州", 120),
    ("济宁", 120),("荆州", 127),("宜昌", 130),("义乌", 132),("丽水", 133),("洛阳", 134),
    ("秦皇岛", 136),("株洲", 143),("石家庄", 147),("莱芜", 148),("常德", 152),("保定", 153),
    ("湘潭", 154),("金华", 157),("岳阳", 169),("长沙", 175),("衢州", 177),("廊坊", 193),
    ("菏泽", 194),("合肥", 229),("武汉", 273),("大庆", 279)
    ]


# 分段形
def creatScatter():


	geo = Geo(
		"全国主要城市空气质量",
		"data from pm2.5",
		width = 1200,
		height = 600,
		title_color = "#000",
		title_pos = "center",
		background_color = "#fff"
		)

	attr, value = geo.cast(data)

	geo.add(
		"",										# name -> str  	图例名称
		attr,									# attr -> list 	属性名称
		value,									# value -> list	属性对应的值
		type="scatter",							# type -> str 	图例类型，scatter , effectScatter, heatmap , 默认为scatter
		maptype='china',						# maptype -> str 地图类型， 需要安装map的包  ，maptype = '广东'
		coordinate_region='中国',				# coordinate_region -> str 城市坐标所属国家，默认为中国
		border_color="#111",					# border_color -> str  地图边界颜色，默认为 #111
		geo_normal_color="#323c48",				# geo_normal_color -> str 正常状态下地图区域的颜色。默认为 #323c48
		geo_emphasis_color="#2a333d",			# geo_emphasis_color -> str 高亮状态下地图区域的颜色，默认为 #2a333d
		geo_cities_coords=None,					# geo_cities_coords -> dict  用户自定义地区经纬度，如{'阿城': [136.58, 45.32]}
		is_roam=True,							# is_roam -> str or bool  是否开启鼠标缩放和平移，默认为True, 还可设置为scale 或 move
		visual_range = [0,300],					# visual_range -> list   渐变颜色取值			
		visual_text_color = "#111",				# visua_text_color -> str  渐变条文本的颜色
		symbol_size = 15,						# symbol_size -> int  标记图形大小，默认为12
		is_visualmap = True						# is_visualmap -> bool 颜色渐变
		)

	geo.render("./地理坐标分段形.html")


# 热力型
def creatHeatmap():

	geo = Geo(
		"全国主要城市空气质量",
		"data from pm2.5",
		width = 1200,
		height = 600,
		title_color = "#000",
		title_pos = "center",
		background_color = "#fff"
		)

	attr, value = geo.cast(data)

	geo.add(
		"",										# name -> str  	图例名称
		attr,									# attr -> list 	属性名称
		value,									# value -> list	属性对应的值
		type="heatmap",							# type -> str 	图例类型，scatter , effectScatter, heatmap , 默认为scatter						# is_roam -> str or bool  是否开启鼠标缩放和平移，默认为True, 还可设置为scale 或 move
		visual_range = [0,300],					# visual_range -> list   渐变颜色取值			
		visual_text_color = "#111",				# visua_text_color -> str  渐变条文本的颜色
		is_visualmap = True						# is_visualmap -> bool 颜色渐变
		)

	geo.render("./地理坐标热力型.html")



# 动画特效图
def createEffectScatter():

	data = [
		("海门", 9), ("鄂尔多斯", 12), ("招远", 12), ("舟山", 12), ("齐齐哈尔", 14), ("盐城", 15)
		]

	geo = Geo(
	    "全国主要城市空气质量",
	    "data from pm2.5",
	    title_color="#fff",
	    title_pos="center",
	    width=1200,
	    height=600,
	    background_color="#404a59",
		)

	attr, value = geo.cast(data)

	geo.add(
		"",
		attr,
		value,
		type="effectScatter",
		is_random = True,
		effect_scale = 5,
		)

	geo.render("./地理坐标动画图.html")    # 如果没加后缀名，会报错： No pyecharts_environment is found for

def main():
	creatScatter()
	creatHeatmap()
	createEffectScatter()


if __name__ == '__main__':
	main()