# 同一网页按顺序展示多图
# 	
# 	page
# 	
# 	Grid/Timeline/Overlap 都可在 Page 中正常展示，把其当做一个图加入到 Page 中即可


from pyecharts import Page, Line, Pie, Kline, Radar



def cLine():

	attr = ["周一", "周二", "周三", "周四", "周五", "周六", "周日"]
	v1 = [11, 11, 15, 13, 12, 13, 10]
	v2 = [1, -2, 2, 5, 3, 2, 0]
	line = Line("折线图示例")
	line.add("最高气温", attr, v1, mark_point=["max", "min"], mark_line=['average'])
	line.add("最低气温", attr, v2, mark_point=["max", "min"], mark_line=['average'])
	page.add(line)

def cPie():

	attr = ["衬衫", "羊毛衫", "雪纺衫", "裤子", "高跟鞋", "袜子"]
	v1 = [11, 12, 13, 10, 10, 10]
	pie = Pie("饼图示例", title_pos='center')
	pie.add("", attr, v1, radius=[40, 75], label_text_color=None, is_label_show=True, legend_orient='vertical', legend_pos='left')
	page.add(pie)

def cKline():

	v1 = [
		[2320.26, 2320.26, 2287.3, 2362.94],
		[2300, 2291.3, 2288.26, 2308.38],
		[2295.35, 2346.5, 2295.35, 2345.92],
		[2347.22, 2358.98, 2337.35, 2363.8],
		[2360.75, 2382.48, 2347.89, 2383.76],
		[2383.43, 2385.42, 2371.23, 2391.82],
		[2377.41, 2419.02, 2369.57, 2421.15],
		[2425.92, 2428.15, 2417.58, 2440.38],
		[2411, 2433.13, 2403.3, 2437.42],
		[2432.68, 2334.48, 2427.7, 2441.73],
		[2430.69, 2418.53, 2394.22, 2433.89],
		[2416.62, 2432.4, 2414.4, 2443.03],
		[2441.91, 2421.56, 2418.43, 2444.8],
		[2420.26, 2382.91, 2373.53, 2427.07],
		[2383.49, 2397.18, 2370.61, 2397.94],
		[2378.82, 2325.95, 2309.17, 2378.82],
		[2322.94, 2314.16, 2308.76, 2330.88],
		[2320.62, 2325.82, 2315.01, 2338.78],
		[2313.74, 2293.34, 2289.89, 2340.71],
		[2297.77, 2313.22, 2292.03, 2324.63],
		[2322.32, 2365.59, 2308.92, 2366.16],
		[2364.54, 2359.51, 2330.86, 2369.65],
		[2332.08, 2273.4, 2259.25, 2333.54],
		[2274.81, 2326.31, 2270.1, 2328.14],
		[2333.61, 2347.18, 2321.6, 2351.44],
		[2340.44, 2324.29, 2304.27, 2352.02],
		[2326.42, 2318.61, 2314.59, 2333.67],
		[2314.68, 2310.59, 2296.58, 2320.96],
		[2309.16, 2286.6, 2264.83, 2333.29],
		[2282.17, 2263.97, 2253.25, 2286.33],
		[2255.77, 2270.28, 2253.31, 2276.22]
		]
	kline = Kline("K 线图示例")
	kline.add("日K", ["2018/8/{}".format(i+1) for i in range(31)], v1)
	page.add(kline)

def cRadar():

	schema = [
	    ("销售", 6500), ("管理", 16000), ("信息技术", 30000),
	   	("客服", 38000), ("研发", 52000), ("市场", 25000)
		]
	v1 = [[4300, 10000, 28000, 35000, 50000, 19000]]
	v2 = [[5000, 14000, 28000, 31000, 42000, 21000]]
	radar = Radar("雷达图示例")
	radar.config(schema)
	radar.add("预算分配", v1, is_splitline=True, is_axisline_show=True)
	radar.add("实际开销", v2, label_color=["#4e79a7"], is_area_show=False,legend_selectedmode='single')
	page.add(radar)


def main():
	cLine()
	cPie()
	cKline()
	cRadar()
	page.render("./页显示.html")

if __name__ == '__main__':
	
	page = Page()
	main()