

图片格式：

	位图(点阵图)	
		1、psd
			Photoshop的专用格式

		2、jpg
			网页制作及日常使用最普通的图像格式

		3、gif
			制作网页小动画的常用图像格式

		4、png
			网页制作及日常使用比较普通的图像格式

		5、webp
			将要取代jpg的图像格式


	矢量图(函数曲线)：

		1、svg
			目前首选的网页矢量图格式

		2、flash
			退出历史的重量级网页矢量图格式



	总结：
		1、 使用大幅面图片时，如果要使用不透明背景的图片，就用jpg图片；
			如果要使用透明或半透明背景的图片，就使用png图片

		2、 使用小幅面图片或图表图片时，如果图片含多种颜色，使用gif 或png 图片；
			如果图片是单色，而且要很好的显示效果，使用svg ；
			如果图片是动画，使用gif.





PS常用图片处理技巧：


	新建图像 ：

		 ctrl + N   颜色模式选RGB ; 网页图片一般选择72像素/英寸; 如果需要打印，设300/英寸； 背景设透明或白色

		 放大：		 Ctrl+“+” 、 Alt+ 滚轮上
		 缩小：  	 Ctrl+“-” 、 Alt+ 滚轮下
		 撤销： 	 Ctrl + Z
		 内容填充：  Shift + F5 
		 复制图层：	 V + Alt + 左键
		 变换： 	 Ctrl + T
		 反选：		 Ctrl+ Shift+ I
		 新建图层：  Ctrl+ Shift+ N
		 取消选择：  Ctrl + D
		 移动： 	 空格键
		 移动： 	 V
		 选框： 	 M 
		 套索： 	 L
		 魔术棒: 	 W
		 橡皮擦：	 E
		 污点修复：  J
		 文字： 	 T
		 减淡加深：  O
		 印章：      S
		 切片：  	 C


		1、 放缩工具 图像放大缩小：    	1）、 按住Alt , 鼠标滚轮上下；
										2）、 Ctrl+“+”放大 Ctrl+“-”缩小
										3）、 双击此工具可以让图像按照原始大小显示。

		2、 平移工具 对图像进行移动：	1）、 在使用其他工具时，按住空格键盘的空格键；松开空格键回到原来的工具
										2）、 双击此工具可以让图像放缩到显示区域完全显示

		3、 移动选择：					1）、 按住Ctrl，在图像上点击可以选中图层；
										2）、 选工具属性栏上的“自动选择图层”，可以在图像上点击选中图层；
										3）、 移动元素同时按住Alt键可复制一个图层；
										4）、 自由变换： Ctrl + T ; 按住Ctrl ，自由变换；
																	按住Shift， 等比变换；
																	按住Alt， 对称变换；
																	中心点可移动，旋转角度
																	结束；双击 或 点 对勾

		5、 撤销和历史记录：			1）、 Ctrl + Z ：只能撤销一步；
										2）、 历史记录： 可以记录20步；（窗口--历史记录）


		4、 选择工具：（抠图工具） 		1）、 矩形选择工具： 	取消选择 Ctrl + D  		（蚂蚁线）
										2）、 椭圆选择工具: 	按住 Shift是个正圆，  alt+shift键可以从中心拉出正圆
										3）、 任意套索工具：	任意套索工具 用手任意画出选区，不精确，不常用；
																多边形套索 可以选择多边形物体，对于结构复杂的物体，可以点多个小段来选择；
																磁性套索 可以自动在物体边缘生成选择线，但是由于太自动了，所以不够精确，也不常用；
																（错误的锚点 可以使用 delete 键删除）	
										4）、 魔术棒选择工具：	点击的点的颜色范围来选择，可以设置范围的容差，容差越大，选择区域越大，
																对于有单色背景的图像中的元素，可以用它点选背景，然后反选，从而选中元素。
																反选(Ctrl+ Shift+ I) /  可以添加选区 / 加选模式

							选区的编辑技巧 ：
											1）、 新选区模式下移动选区 （选框属性）
											2）、 变换选取：Ctrl + T 
											3）、 复制、粘贴： Ctrl + C /  Ctrl + V
											4）、 删除 ：delete
											5）、 填充 ：可以是前景色、内容填充   Shift + F5 
											6）、 描边 ： 编辑---描边


		5、 擦除与修复工具：
										1）、 橡皮擦：  注意透明度
										2）、 污点修复工具： 


		6、 裁剪：
										1） 、 裁剪：
										2） 、 切片： 	切片存储为web所用格式， 会把所有切片文件保存在1个名为images文件夹中
										3） 、 切片选择工具：







		雪碧图制作： 把所有的装饰性图片放在一张图片上。